#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/doics/oteldemostack/runs/run-EnRm72wgGmuYDpyK

Waiting for the plan to start...

Terraform v1.2.4
on linux_amd64
Initializing plugins and modules...
module.heroku_backstage.heroku_app.backstage: Refreshing state... [id=7d8e2caf-90d0-43a3-979d-381a7622a0be]
module.grafana_cloud.grafana_cloud_stack.oteldemo: Refreshing state... [id=395958]
module.grafana_cloud.grafana_cloud_api_key.metrics: Refreshing state... [id=proffalken-metrics-publisher]
module.grafana_cloud.grafana_cloud_api_key.metrics_viewer: Refreshing state... [id=proffalken-metrics-viewer]
module.grafana_cloud.grafana_cloud_api_key.plugins: Refreshing state... [id=proffalken-plugin-publisher]
module.grafana_cloud.grafana_api_key.management: Refreshing state... [id=2]
module.grafana_cloud.grafana_cloud_api_key.admin: Refreshing state... [id=proffalken-admin]
module.heroku_backstage.heroku_config.backstage_config: Refreshing state... [id=config-1657146778]
module.heroku_backstage.data.herokux_registry_image.backstage: Reading...
module.heroku_backstage.heroku_app_config_association.backstage: Refreshing state... [id=config:7d8e2caf-90d0-43a3-979d-381a7622a0be]
module.heroku_backstage.heroku_addon.backstage_pgsql: Refreshing state... [id=a92c175b-9d12-4c9d-8039-1d30cccb982f]
module.heroku_backstage.data.herokux_registry_image.backstage: Read complete after 1s [id=7d8e2caf-90d0-43a3-979d-381a7622a0be:web:latest]
module.heroku_backstage.herokux_app_container_release.backstage: Refreshing state... [id=7d8e2caf-90d0-43a3-979d-381a7622a0be:web]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.google_cloud.google_compute_instance.default will be created
  + resource "google_compute_instance" "default" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "e2-micro"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "test"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags_fingerprint     = (known after apply)
      + zone                 = "us-central1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "debian-cloud/debian-9"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = "default"
          + network_ip         = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + min_node_cpus       = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)
          + provisioning_model  = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      + service_account {
          + email  = (known after apply)
          + scopes = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
        }
    }

  # module.google_cloud.google_service_account.default will be created
  + resource "google_service_account" "default" {
      + account_id   = "compute-instances"
      + disabled     = false
      + display_name = "Compute Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @proffalken, Action: `pull_request`*